import ReactMarkdown from "react-markdown";

export default function About() {
  return (
    <div className="flex flex-col gap-8 max-w-xl">
      <h1 className="text-4xl sm:text-5xl font-bold text-center">
       <span>درباره وبلاگ{" "}</span><span className="primary-color">آتریپا</span>
      </h1>
      <ReactMarkdown className="flex flex-col gap-6">
        {aboutContent}
      </ReactMarkdown>
    </div>
  );
}

const aboutContent = `

# درباره MDXBlog

برخلاف راه‌حل‌های سنتی وبلاگ‌نویسی که برای ذخیره محتوا به پایگاه داده متکی هستند، مدیریت محتوا در MDXBlog از طریق فایل‌های Markdown (mdx) که به راحتی قابل ویرایش هستند و در یک پوشه روی دستگاه محلی شما قرار دارند، انجام می‌شود! این یک راه‌حل مناسب برای کسانی است که سادگی Markdown و قدرت کامپوننت‌های React را ارج می‌نهند.

MDXBlog (mdxblog.io) یک قالب برنامه وبلاگ است که به طور مستقل با جدیدترین فناوری‌های وب ساخته شده و تجربه وبلاگ‌نویسی منحصر به فردی را ارائه می‌دهد. MDXBlog یک قالب ساده برای ایجاد وبلاگ با استفاده از MDX (Markdown + JSX) و Next.js 14 است. ما هیچ وابستگی رسمی با تیم MDX یا Next.js نداریم، ما صرفاً طرفداران این فناوری هستیم و می‌خواستیم یک قالب وبلاگ ساده، رایگان و آسان برای استفاده جامعه ایجاد کنیم.

پروژه ما به طور کامل در GitHub در دسترس است.

مقالات مرتبط را در وبلاگ پیدا کنید، از جمله:

• نصب
• راهنمای کاربر
• بینش‌های توسعه

## شروع کار

### نصب:

• مخزن را کلون کنید
• 'npm install' را اجرا کنید
• 'npm run dev' را اجرا کنید
• 'http://localhost:3000' را در مرورگر خود باز کنید
• یک مخزن از راه دور در GitHub ایجاد کنید
• مخزن محلی خود را به GitHub پوش کنید
• روی Vercel مستقر کنید

### ایجاد یک پست:

• از آیکون '+' در نوار ناوبری، فقط در حالت توسعه، برای ایجاد یک پست جدید استفاده کنید - یا به سادگی یک فایل MDX جدید در دایرکتوری 'data/posts' به صورت دستی ایجاد کنید.
• پست‌ها را در مرورگر یا به صورت دستی با استفاده از VS Code (توصیه شده) یا هر ویرایشگر متن دیگری ویرایش کنید.

## ویژگی‌های کلیدی MDX Blog:

• **Next.js 14 و App Router:** با استفاده از ویژگی‌های پیشرفته Next.js 14، MDX Blog تجربه کاربری روان و کارآمدی را ارائه می‌دهد که توسط روتر قدرتمند برنامه برای ناوبری روان پشتیبانی می‌شود.

• **مستقر شده روی Vercel:** قابلیت اطمینان و سرعت Vercel را تجربه کنید که اطمینان می‌دهد سایت وبلاگ استاتیک ما همیشه در دسترس است و عملکرد فوق‌العاده‌ای دارد.

• **بهینه‌سازی شده برای SEO:** با تولید خودکار نقشه سایت در زمان ساخت از طریق 'next sitemap'، پلتفرم ما برای بهینه‌سازی موتور جستجو تنظیم شده است و دید و دسترسی محتوای شما را افزایش می‌دهد.

• **انتشار پویا:** پلتفرم ما به طور هوشمندانه پست‌های با تاریخ آینده را مدیریت می‌کند و اطمینان می‌دهد که آنها فقط در تاریخ تعیین شده یا پس از آن منتشر می‌شوند، به لطف یک سیستم فیلترینگ دقیق.

• **ویژگی‌های حالت توسعه:** در حالت توسعه، کاربران می‌توانند به سرعت با استفاده از آیکون '+' پست‌های جدید ایجاد کنند که فرآیند تولید محتوا را ساده می‌کند.

• **ویرایش محتوای انعطاف‌پذیر:** پست‌های MDX (Markdown + JSX) خود را به راحتی ویرایش کنید، چه مستقیماً در مرورگر یا با استفاده از VS Code، که محیطی انعطاف‌پذیر و کاربرپسند برای تولیدکنندگان محتوا فراهم می‌کند.

### کامپوننت‌های سفارشی MDX:

**<YouTube />**: ویدیوهای YouTube را به راحتی در محتوای خود جاسازی کنید.
**<Image />**: تصاویر را به زیبایی ادغام کنید و جذابیت بصری پست‌های خود را افزایش دهید.
**code**: قطعات کد را با وضوح و سبک نمایش دهید و ارائه کنید.

## رندر صفحه پویا

سیستم رندر صفحه پویای ما ستون فقرات MDX Blog است که با دقت محتوا را استخراج و ارائه می‌کند. این سیستم از next-mdx-remote/rsc برای رندر محتوای MDX، همراه با کامپوننت‌های سفارشی مانند YouTube، Image و Code استفاده می‌کند و تجربه وبلاگ‌نویسی غنی و تعاملی را به ارمغان می‌آورد.

## بینش‌های توسعه:

• با استفاده از gray-matter برای تجزیه front matter، ما متادیتای مهم را برای اهداف SEO و رندر استخراج می‌کنیم.
• فقط پست‌های مرتبط بر اساس تاریخ انتشارشان نمایش داده می‌شوند.
• در حالت توسعه، ابزارهای اضافی مانند EditPostButton و OpenInVSCode در دسترس هستند که سهولت مدیریت و ویرایش محتوا را افزایش می‌دهند.

MDX Blog نشان‌دهنده ترکیبی از نوآوری فناوری و طراحی کاربرمحور است که پلتفرمی را ارائه می‌دهد که نه تنها استفاده از آن لذت‌بخش است، بلکه در قابلیت‌های خود نیز قدرتمند است. چه شما یک توسعه‌دهنده باشید، یک تولیدکننده محتوا یا کسی که به وبلاگ‌نویسی علاقه‌مند است، MDX Blog ابزارهایی را برای به اشتراک گذاشتن داستان‌ها و ایده‌های شما با جهان به راحتی ارائه می‌دهد.

`;
