import ReactMarkdown from "react-markdown";

export default function Privacy() {
  return (
    <div className="flex flex-col gap-8 max-w-xl">
      <h1 className="text-4xl sm:text-5xl font-bold text-center">
      سیاست حفظ حریم خصوصی
      </h1>
      <ReactMarkdown className="flex flex-col gap-6">
        {privacyContent}
      </ReactMarkdown>
    </div>
  );
}

const privacyContent = `

## تاریخ موثر: ۱ دسامبر ۲۰۲۳

به وبلاگ MDX خوش آمدید. حریم خصوصی شما برای ما مهم است. این سیاست حفظ حریم خصوصی توضیح می‌دهد که چگونه اطلاعات شما را جمع‌آوری، استفاده، افشا و محافظت می‌کنیم هنگامی که از وب‌سایت ما MDXBlog.io بازدید می‌کنید، از جمله هر نوع رسانه دیگر، کانال رسانه‌ای، وب‌سایت موبایل، یا برنامه موبایلی که به آن مرتبط یا متصل است (که به‌طور جمعی به عنوان "سایت" شناخته می‌شود). لطفاً این سیاست حفظ حریم خصوصی را با دقت بخوانید. اگر با شرایط این سیاست حفظ حریم خصوصی موافق نیستید، لطفاً به سایت دسترسی نداشته باشید.

**۱. جمع‌آوری اطلاعات شما**

ما ممکن است اطلاعاتی درباره شما به روش‌های مختلف جمع‌آوری کنیم. اطلاعاتی که ممکن است در سایت جمع‌آوری کنیم شامل موارد زیر است:

   *داده‌های شخصی:* اطلاعات شناسایی شخصی، مانند نام و آدرس ایمیل شما، که به‌طور داوطلبانه به ما می‌دهید هنگامی که تصمیم می‌گیرید در فعالیت‌های مختلف مرتبط با سایت شرکت کنید. شما هیچ الزامی برای ارائه اطلاعات شخصی از هر نوع به ما ندارید، اما امتناع شما از انجام این کار ممکن است مانع استفاده شما از برخی ویژگی‌های سایت شود.

**۲. افشای اطلاعات شما**

ما ممکن است اطلاعاتی که درباره شما جمع‌آوری کرده‌ایم را در شرایط خاصی به اشتراک بگذاریم. اطلاعات شما ممکن است به شرح زیر افشا شود:

   *براساس قانون یا برای حفاظت از حقوق:* اگر ما معتقد باشیم که افشای اطلاعات درباره شما برای پاسخ به فرآیند قانونی ضروری است، برای بررسی یا جبران نقض‌های احتمالی سیاست‌های ما، یا برای حفاظت از حقوق، اموال و ایمنی دیگران، ممکن است اطلاعات شما را به‌طور مجاز یا مورد نیاز توسط هر قانون، قاعده یا مقررات قابل اجرا به اشتراک بگذاریم.

**۳. امنیت اطلاعات شما**

ما از اقدامات امنیتی اداری، فنی و فیزیکی برای کمک به حفاظت از اطلاعات شخصی شما استفاده می‌کنیم. در حالی که ما اقدامات معقولی برای ایمن‌سازی اطلاعات شخصی که به ما ارائه می‌دهید انجام داده‌ایم، لطفاً آگاه باشید که علی‌رغم تلاش‌های ما، هیچ اقدام امنیتی کامل یا غیرقابل نفوذ نیست و هیچ روش انتقال داده‌ای نمی‌تواند در برابر هر نوع رهگیری یا سوءاستفاده دیگری تضمین شود.

**۴. تماس با ما**

اگر سوالات یا نظراتی درباره این سیاست حفظ حریم خصوصی دارید، لطفاً با ما تماس بگیرید: owolfdev@gmail.com.

`;
