import ReactMarkdown from "react-markdown";

export default function Privacy() {
  return (
    <div className="flex flex-col gap-8 max-w-xl">
      <h1 className="text-4xl sm:text-5xl font-bold text-center">
      سیاست حفظ حریم خصوصی
      </h1>
      <ReactMarkdown className="flex flex-col gap-6">
        {privacyContent}
      </ReactMarkdown>
    </div>
  );
}

const privacyContent = `
• کوکی، یکی از ابزارهایی است که در تعامل و گفتگوی بین مرورگر و سایت‌ها استفاده می‌شود و فایلهای کوچکی هستند که در سمت کاربر ذخیره می گردند. آتریپا هم براساس همین قاعده از کوکی استفاده می‌کند. بااین‌حال کاربران می‌توانند مرورگرشان را به گونه‌ای تنظیم نمایند که هیچ‌وقت کوکی دریافت نکنند؛ اما در‌این‌صورت ممکن است بخشی از خدماتی را که آتریپا ارائه می‌کند از دست بدهند.

• جمع‌آوری اطلاعات: ما از شما برای ارائه خدمات بهتر، خرید بلیط و رزرو هتل، اطلاعات شخصی مانند نام، آدرس ایمیل، شماره همراه و اطلاعات مالی را از شما دریافت می کنیم. اطلاعات شما تنها برای اهداف مشخص شده استفاده می‌شوند و هرگونه استفاده دیگر از اطلاعات شخصی شما بدون اجازه شما صورت نمی‌گیرد.

• استفاده از اطلاعات: اطلاعات جمع‌آوری شده توسط ما برای ارائه خدمات بهتر، پشتیبانی مشتریان، پردازش پرداخت‌ها و ارسال اطلاعیه‌های مربوط به خدمات به شما استفاده می‌شود. همچنین با توجه به اطلاعات مربوط به تجربه کاربری شما، پیشنهادات بهتری به شما ارائه خواهیم داد که این اطلاعات به نحوی مورد استفاده قرار می‌گیرند که به طور مستقیم به یک شخص حقیقی مشخص مرتبط نباشند. ما اطلاعات شما را به طور محرمانه در اختیار داریم و آن‌ها را به شخص ثالثی منتقل نمی‌کنیم مگر اینکه اجازه شما را داشته باشیم یا به طور قانونی ملزم به این کار باشیم.

• امنیت: ما اقدامات امنیتی لازم را برای حفاظت از اطلاعات شخصی شما اتخاذ می‌کنیم تا از دسترسی غیرمجاز، استفاده، افشا و یا تغییر غیرمجاز اطلاعات شما جلوگیری کنیم.

• کنترل اطلاعات: شما حق دارید تا به اطلاعات شخصی خود دسترسی داشته باشید و آن‌ها را ویرایش کنید. ما درخواست‌های شما را با رعایت قوانین حریم خصوصی و به سرعت پاسخ خواهیم داد.

• تعهد کاربر: کاربر متعهد می‌شود از هرگونه فعالیتی که به هک کردن اطلاعات سایت یا اختلال در عملکرد آن منجر شود، خودداری کند و در صورت مشاهده هرگونه نشانه‌ای از تهدید به امنیت، فورا به مدیریت سایت اطلاع دهد.

• با استفاده از وبسایت و اپلیکیشن آتریپا، شما با این قوانین موافقت می‌کنید. اگر سوالی در مورد سیاست های ما دارید، لطفاً با ما تماس بگیرید.
`;
